# Handling / Removing Outliers

In [21]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [22]:
tit = pd.read_csv('../Course_Materials_Part1/Video_Lecture_NBs/titanic.csv')

In [23]:
tit.dropna(inplace=True)

In [25]:
tit.reset_index(inplace=True)

In [26]:
tit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 182 entries, 0 to 181
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   index     182 non-null    int64
 1   survived  182 non-null    int64
 2   pclass    182 non-null    int64
 3   sex       182 non-null    object
 4   age       182 non-null    float64
 5   sibsp     182 non-null    int64
 6   parch     182 non-null    int64
 7   fare      182 non-null    float64
 8   embarked  182 non-null    object
 9   deck      182 non-null    object
dtypes: float64(2), int64(5), object(3)
memory usage: 14.3+ KB

In [29]:
tit = tit.iloc[:, 1:]

In [30]:
tit

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           1       1  female  38.0      1      0  71.2833        C    C
1           1       1  female  35.0      1      0  53.1000        S    C
2           0       1    male  54.0      0      0  51.8625        S    E
3           1       3  female   4.0      1      1  16.7000        S    G
4           1       1  female  58.0      0      0  26.5500        S    C
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
177         1       1  female  47.0      1      1  52.5542        S    D
178         0       1    male  33.0      0      0   5.0000        S    B
179         1       1  female  56.0      0      1  83.1583        C    C
180         1       1  female  19.0      0      0  30.0000        S    B
181         1       1    male  26.0      0      0  30.0000        C    C

[182 rows x 9 columns]

In [31]:
tit.loc[tit.age > 75]

     survived  pclass   sex   age  sibsp  parch  fare embarked deck
128         1       1  male  80.0      0      0  30.0        S    A

In [32]:
index_outl = tit.loc[tit.age > 75].index

In [33]:
index_outl

Int64Index([128], dtype='int64')

In [35]:
tit.loc[index_outl, "age"] = 20

In [37]:
tit.loc[128]

survived       1
pclass         1
sex         male
age         20.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 128, dtype: object